# Chapter 7

In [1]:
import numpy as np
import pandas as pd

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [3]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [4]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [5]:
string_data[0] = None

In [6]:
from numpy import nan as NA

In [7]:
data = pd.Series([1, NA, 3.5, NA, 7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
cleaned = data.dropna()

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4] = NA

In [16]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [17]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df = pd.DataFrame(np.random.randn(7,3))

In [19]:
df.iloc[:4, 1] = NA

In [20]:
df.iloc[:2, 2] = NA

In [21]:
df

          0         1         2
0 -0.797857       NaN       NaN
1 -0.500096       NaN       NaN
2  0.084521       NaN  0.835247
3 -0.261693       NaN -0.650177
4 -0.671264  1.175393  0.644212
5  0.018090  0.014257  0.886004
6 -1.483894 -0.856713  0.817801

In [22]:
df.dropna()

          0         1         2
4 -0.671264  1.175393  0.644212
5  0.018090  0.014257  0.886004
6 -1.483894 -0.856713  0.817801

In [23]:
df.dropna(thresh=2)

          0         1         2
2  0.084521       NaN  0.835247
3 -0.261693       NaN -0.650177
4 -0.671264  1.175393  0.644212
5  0.018090  0.014257  0.886004
6 -1.483894 -0.856713  0.817801

In [24]:
df.fillna(0)

          0         1         2
0 -0.797857  0.000000  0.000000
1 -0.500096  0.000000  0.000000
2  0.084521  0.000000  0.835247
3 -0.261693  0.000000 -0.650177
4 -0.671264  1.175393  0.644212
5  0.018090  0.014257  0.886004
6 -1.483894 -0.856713  0.817801

In [25]:
df.fillna({1:0.5, 2: 0})

          0         1         2
0 -0.797857  0.500000  0.000000
1 -0.500096  0.500000  0.000000
2  0.084521  0.500000  0.835247
3 -0.261693  0.500000 -0.650177
4 -0.671264  1.175393  0.644212
5  0.018090  0.014257  0.886004
6 -1.483894 -0.856713  0.817801

In [26]:
_ = df.fillna(0, inplace=True)

In [27]:
df

          0         1         2
0 -0.797857  0.000000  0.000000
1 -0.500096  0.000000  0.000000
2  0.084521  0.000000  0.835247
3 -0.261693  0.000000 -0.650177
4 -0.671264  1.175393  0.644212
5  0.018090  0.014257  0.886004
6 -1.483894 -0.856713  0.817801

In [28]:
df = pd.DataFrame(np.random.randn(6, 3))

In [29]:
df.iloc[2:, 1]= NA

In [30]:
df.iloc[4:, 2]= NA

In [31]:
df

          0         1         2
0  0.576014 -0.865826 -0.710548
1 -0.954175  1.236046  0.662787
2  0.468843       NaN  0.333824
3 -0.168981       NaN -0.276078
4 -0.457752       NaN       NaN
5  0.173627       NaN       NaN

In [32]:
df.fillna(method='ffill')

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_67722/1193302488.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')

          0         1         2
0  0.576014 -0.865826 -0.710548
1 -0.954175  1.236046  0.662787
2  0.468843  1.236046  0.333824
3 -0.168981  1.236046 -0.276078
4 -0.457752  1.236046 -0.276078
5  0.173627  1.236046 -0.276078

In [33]:
df.fillna(method='ffill', limit=2)

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_67722/2719175769.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)

          0         1         2
0  0.576014 -0.865826 -0.710548
1 -0.954175  1.236046  0.662787
2  0.468843  1.236046  0.333824
3 -0.168981  1.236046 -0.276078
4 -0.457752       NaN -0.276078
5  0.173627       NaN -0.276078

In [34]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [35]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [36]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [37]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [38]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [39]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [40]:
data['v1'] = range(7)

In [41]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [42]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [43]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon',
         'pastrami', 'honey ham', 'nova lox'],
'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [44]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [45]:
meat_to_animal = {
      'bacon': 'pig',
      'pulled pork': 'pig',
      'pastrami': 'cow',
      'corned beef': 'cow',
      'honey ham': 'pig',
      'nova lox': 'salmon'
}

In [46]:
lowercased = data['food'].str.lower()

In [47]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [48]:
data['animal'] = lowercased.map(meat_to_animal)

In [49]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [50]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [51]:
data = pd.Series([1., -999., 2., -999., -1000, 3.])

In [52]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [53]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [54]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [55]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [56]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [57]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])

In [58]:
transform = lambda x: x[:4].upper()

In [59]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [60]:
data.index = data.index.map(transform)

In [61]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [62]:
data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [63]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [64]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [65]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [66]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [67]:
bins = [18, 25, 35, 60, 100]

In [68]:
cats = pd.cut(ages, bins)

In [69]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [70]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [71]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [72]:
pd.value_counts(cats)

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_67722/1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [73]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64, left]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [74]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [75]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [76]:
data = np.random.rand(20)

In [77]:
pd.cut(data, 4, precision=2)

[(0.02, 0.26], (0.51, 0.75], (0.26, 0.51], (0.51, 0.75], (0.75, 0.99], ..., (0.75, 0.99], (0.75, 0.99], (0.02, 0.26], (0.75, 0.99], (0.26, 0.51]]
Length: 20
Categories (4, interval[float64, right]): [(0.02, 0.26] < (0.26, 0.51] < (0.51, 0.75] < (0.75, 0.99]]

In [78]:
group_names = ['Youth', 'YounAdult', 'MiddleAged', 'Senior']

In [79]:
pd.cut(ages, bins, labels=group_names)

['Youth', 'Youth', 'Youth', 'YounAdult', 'Youth', ..., 'YounAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YounAdult']
Length: 12
Categories (4, object): ['Youth' < 'YounAdult' < 'MiddleAged' < 'Senior']

In [80]:
data = np.random.rand(20)

In [81]:
pd.cut(data, 4, precision=2)

[(0.059, 0.29], (0.53, 0.76], (0.53, 0.76], (0.059, 0.29], (0.53, 0.76], ..., (0.76, 0.99], (0.76, 0.99], (0.29, 0.53], (0.53, 0.76], (0.059, 0.29]]
Length: 20
Categories (4, interval[float64, right]): [(0.059, 0.29] < (0.29, 0.53] < (0.53, 0.76] < (0.76, 0.99]]

In [82]:
data = np.random.randn(1000)

In [83]:
cats = pd.qcut(data, 4)

In [84]:
cats

[(-0.124, 0.592], (-2.864, -0.786], (-2.864, -0.786], (-2.864, -0.786], (-0.786, -0.124], ..., (-2.864, -0.786], (0.592, 3.331], (-0.124, 0.592], (-0.124, 0.592], (-0.786, -0.124]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.864, -0.786] < (-0.786, -0.124] < (-0.124, 0.592] < (0.592, 3.331]]

In [85]:
pd.value_counts(cats)

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_67722/1485279302.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(cats)

(-2.864, -0.786]    250
(-0.786, -0.124]    250
(-0.124, 0.592]     250
(0.592, 3.331]      250
Name: count, dtype: int64

In [86]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-0.124, 1.155], (-1.353, -0.124], (-2.864, -1.353], (-1.353, -0.124], (-1.353, -0.124], ..., (-1.353, -0.124], (-0.124, 1.155], (-0.124, 1.155], (-0.124, 1.155], (-1.353, -0.124]]
Length: 1000
Categories (4, interval[float64, right]): [(-2.864, -1.353] < (-1.353, -0.124] < (-0.124, 1.155] < (1.155, 3.331]]

In [87]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [88]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.011261    -0.054698     0.045650    -0.005618
std       1.022097     1.012305     0.989341     1.054671
min      -3.307602    -2.999590    -3.087871    -3.425605
25%      -0.673901    -0.736981    -0.617485    -0.689380
50%      -0.012975    -0.088032     0.023768    -0.003371
75%       0.721153     0.583472     0.688514     0.714691
max       2.956419     3.405909     3.325536     3.837559

In [89]:
col = data[2]

In [90]:
col[np.abs(col) > 3]

102    3.325536
154   -3.015739
289    3.042955
548    3.122530
684   -3.087871
Name: 2, dtype: float64

In [95]:
data[(np.abs(data) > 3).any(axis=1)]
# corrected.  Error on "data[(np.abs(data) > 3).any(1)]"

            0         1         2         3
87   0.594136 -0.773111 -0.645370 -3.045209
102  0.163108  1.061061  3.325536 -1.604608
154 -1.939257  1.752655 -3.015739  0.475269
206 -3.307602 -1.044265 -0.808257 -1.248217
289 -0.905808 -0.506822  3.042955 -0.055519
311  0.924050  0.629425  0.563569  3.624486
385  0.675818  3.405909  0.052596 -0.054910
548  1.312816 -1.581003  3.122530 -2.471282
671 -1.861474 -0.144446  0.768451  3.138710
684  0.185180 -1.195602 -3.087871  0.428825
754 -0.321409 -0.312483  2.470070  3.837559
831  2.820713 -0.172527  0.044685 -3.425605

In [96]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [97]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.010954    -0.055104     0.045262    -0.006748
std       1.021149     1.010997     0.987486     1.048132
min      -3.000000    -2.999590    -3.000000    -3.000000
25%      -0.673901    -0.736981    -0.617485    -0.689380
50%      -0.012975    -0.088032     0.023768    -0.003371
75%       0.721153     0.583472     0.688514     0.714691
max       2.956419     3.000000     3.000000     3.000000

In [98]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0  1.0  1.0
1 -1.0 -1.0 -1.0  1.0
2 -1.0 -1.0  1.0 -1.0
3  1.0 -1.0  1.0 -1.0
4  1.0  1.0 -1.0  1.0

In [99]:
df = pd.DataFrame(np.arange(5 *4).reshape((5,4)))

In [100]:
sampler= np.random.permutation(5)

In [101]:
sampler

array([1, 3, 2, 0, 4])

In [102]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [103]:
df.take(sampler)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3
4  16  17  18  19

In [104]:
df.sample(n=3)

    0   1   2   3
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [105]:
choices = pd.Series([5, 7,-1, 6,4])

In [106]:
draws = choices.sample(n=10, replace=True)

In [107]:
draws

4    4
1    7
0    5
3    6
1    7
3    6
3    6
4    4
4    4
1    7
dtype: int64

In [108]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})

In [109]:
pd.get_dummies(df['key'])

       a      b      c
0  False   True  False
1  False   True  False
2   True  False  False
3  False  False   True
4   True  False  False
5  False   True  False

In [110]:
dummies = pd.get_dummies(df['key'], prefix='key')

In [111]:
df_with_dummy = df[['data1']].join(dummies)

In [112]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0  False   True  False
1      1  False   True  False
2      2   True  False  False
3      3  False  False   True
4      4   True  False  False
5      5  False   True  False

In [113]:
mnames = ['movie_id', 'title', 'genres']

In [114]:
movies = pd.read_table('examples/movies.dat', sep='::', header=None, names=mnames)

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_67722/1817561731.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  movies = pd.read_table('examples/movies.dat', sep='::', header=None, names=mnames)

In [115]:
movies[:10]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [116]:
all_genres = []

In [117]:
for x in movies.genres:
    all_genres.extend(x.split('|'))

In [118]:
genres = pd.unique(all_genres)

/var/folders/9f/51kqfykj067ddd68rlj_8mv40000gp/T/ipykernel_67722/1657210076.py:1: FutureWarning: unique with argument that is not not a Series, Index, ExtensionArray, or np.ndarray is deprecated and will raise in a future version.
  genres = pd.unique(all_genres)

In [119]:
genres

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [120]:
zero_matrix = np.zeros((len(movies), len(genres)))

In [121]:
dummies = pd.DataFrame(zero_matrix, columns=genres)

In [122]:
gen= movies.genres[0]

In [123]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [124]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2])

In [125]:
for i, gen in enumerate(movies.genres):
    indices = dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i, indices] = 1

In [126]:
movies_windic = movies.join(dummies.add_prefix('Genre'))

In [127]:
movies_windic.iloc[0]

movie_id                                      1
title                          Toy Story (1995)
genres              Animation|Children's|Comedy
GenreAnimation                              1.0
GenreChildren's                             1.0
GenreComedy                                 1.0
GenreAdventure                              0.0
GenreFantasy                                0.0
GenreRomance                                0.0
GenreDrama                                  0.0
GenreAction                                 0.0
GenreCrime                                  0.0
GenreThriller                               0.0
GenreHorror                                 0.0
GenreSci-Fi                                 0.0
GenreDocumentary                            0.0
GenreWar                                    0.0
GenreMusical                                0.0
GenreMystery                                0.0
GenreFilm-Noir                              0.0
GenreWestern                                0.0
Name: 0, dtype: object

In [128]:
np.random.seed(12345)

In [129]:
values = np.random.rand(10)

In [130]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [131]:
bins = [0, 0.2, 0.4, 0.6, 0.8, 1]

In [132]:
pd.get_dummies(pd.cut(values, bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0       False       False       False       False        True
1       False        True       False       False       False
2        True       False       False       False       False
3       False        True       False       False       False
4       False       False        True       False       False
5       False       False        True       False       False
6       False       False       False       False        True
7       False       False       False        True       False
8       False       False       False        True       False
9       False       False       False        True       False

In [133]:
val = 'a,b, guido'

In [134]:
val.split(',')

['a', 'b', ' guido']

In [135]:
['a', 'b', '  guido']

['a', 'b', '  guido']

In [136]:
pieces = [x.strip() for x in val.split(',')]

In [137]:
pieces

['a', 'b', 'guido']

In [146]:
first, second, third = pieces

In [147]:
first + '::' + second + '::' + third

'a::b::guido'

In [148]:
'::'.join(pieces)

'a::b::guido'

In [149]:
'guido' in val

True

In [150]:
val.index(',')

1

In [151]:
val.find(':')

-1

In [152]:
        # Note the difference between find and index is that index raises an exception if the string isnt found (versus returning 1):
try:
    val.index(':')
except ValueError:
        # Handle the case where ':' is not found in val
    print("':' not found in val")

':' not found in val

In [153]:
val.count(',')

2

In [154]:
val.replace(',', '::')

'a::b:: guido'

In [155]:
val.replace(',', '')

'ab guido'

In [156]:
import re

In [157]:
text = "foo     bar\t baz   \tqux"

In [158]:
re.split('\\s+', text)

['foo', 'bar', 'baz', 'qux']

In [159]:
regex = re.compile('\\s+')

In [160]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [161]:
regex.findall(text)

['     ', '\t ', '   \t']

In [162]:
    text = """Dave dave@google.com
    Steve steve@gmail.com
    Rob rob@gmail.com
    Ryan ryan@yahoo.com
    """
    pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'
    # re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [163]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [164]:
m = regex.search(text)

In [165]:
m

In [166]:
text[m.start():m.end()]

'dave@google.com'

In [167]:
print(regex.match(text))

None

In [168]:
print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [169]:
pattern = r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [170]:
regex = re.compile(pattern, flags=re.IGNORECASE)

In [171]:
m = regex.match('wesm@beright.net')

In [172]:
m.groups()

('wesm', 'beright', 'net')

In [173]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [174]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

In [175]:
data = {'Dave': 'dave@google.com', 'Steve': 'steve@gmail.com',
       .....:         'Rob': 'rob@gmail.com', 'Wes': np.nan}

In [176]:
data = pd.Series(data)

In [177]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [178]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [179]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [180]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [181]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [182]:
matches = data.str.match(pattern, flags=re.IGNORECASE)

In [183]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [184]:
data.str.get(1)

Dave       a
Steve      t
Rob        o
Wes      NaN
dtype: object

In [185]:
data.str[0]

Dave       d
Steve      s
Rob        r
Wes      NaN
dtype: object

In [186]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object